Конфигурация/InformationRegisters/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеПолномочий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСОтчетамиКлиент/Ext/Module.bsl
Процедура АвтоматическоеФормированиеОтчета(Форма, Результат) Экспорт 

	Форма.НастройкиОтчета.Вставить("Результат", Результат);
	ОткрытьФормуОтчета(Форма);
	
КонецПроцедуры

Функция ТребуетсяОткрытьФорму(НастройкиОтчета) Экспорт

	Перем СтруктураДействий;	
	
	Возврат НастройкиОтчета.Свойство("СтруктураДействий", СтруктураДействий)
		И (СтруктураДействий.Свойство("ОткрытьФорму") И СтруктураДействий.ОткрытьФорму = Истина
			ИЛИ СтруктураДействий.Свойство("ОткрытьИПерезаполнить") И СтруктураДействий.ОткрытьИПерезаполнить = Истина);
	
КонецФункции

Процедура ОткрытьФормуОтчета(Форма) Экспорт

	Если ТребуетсяОткрытьФорму(Форма.НастройкиОтчета) И Не Форма.Открыта() Тогда
		Форма.Открыть();
	КонецЕсли;

КонецПроцедуры

Процедура НапечататьФайл(ИмяФайла) Экспорт
	
	Shell = Новый COMОбъект("Shell.Application");
	
	Shell.ShellExecute(ИмяФайла, "", "", "print", 1);
	
КонецПроцедуры

// Загружает схему из хранилища в универсальный отчет и показывает результат компоновки пользователю.
//
// Параметры:
//   Схема				-	Двоичные данные	- двоичные данные, в которых хранится СКД.
//   ЗначенияПараметров	-	Структура		- значения параметров СКД, где Ключ - имя параметра, Значение - значение параметра.
//
Процедура ЗагрузитьСхемуВУниверсальныйОтчет(Схема, ЗначенияПараметров) Экспорт
	
	Форма = ПолучитьФорму("Отчет.УниверсальныйОтчет.Форма");
	Форма.ЗагрузитьСхемуИВыполнитьКомпоновку(Схема, ЗначенияПараметров);
	
КонецПроцедуры

#Область Работа_с_подписантами

Процедура ПодписантОтчетаНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка) Экспорт
	
	ПодписантНачалоВыбора(ЭтаФорма, Элемент, ЭтаФорма.Подписант, ЭтаФорма.Отчет.Организация, СтандартнаяОбработка);	
	
КонецПроцедуры

// Общий обработчик события начала выбора подписанта
//
// Параметры:
//	ЭтаФорма				- ФормаКлиентскогоПриложения												- форма
//	Элемент					- ПолеФормы																	- элемент управления, связанный с подписантом
//	Подписант				- Строка, СправочникСсылка.ЮрФизЛицо										- текущий подписант
//	Объект					- СправочникСсылка.Организации												- организация, для которой выбирается подписант
//							- СправочникСсылка.ЮрФизЛицо, СправочникСсылка.ПаевыеИнвестиционныеФонды	- клиент, для которого выбирается подписант
//	СтандартнаяОбработка	- Булево																	- выходной параметр, заполняется значением Ложь
//
Процедура ПодписантНачалоВыбора(ЭтаФорма, Элемент, Подписант, Объект, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Объект, КонтактноеЛицо", Объект, Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

Процедура ПодписантОтчетаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение) Экспорт
	
	ДополнительныеСвойства = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;		
	
	Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица") Тогда
		ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица");	
	КонецЕсли;	
	
	ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ДополнительныеСвойства.СтруктураДанныхКонтактногоЛица, ЭтаФорма.Отчет.Организация);	
	
КонецПроцедуры

Процедура ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, СтруктураДанныхКонтактногоЛица, Объект) Экспорт
	
	ДанныеКонтактногоЛица = Неопределено;	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		ДанныеКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ВыбранноеЗначение, Объект);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.КонтактныеЛица") Тогда
		ДанныеКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	КонецЕсли;	
		
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьСтруктуруДанныхКонтактногоЛица(ДанныеКонтактногоЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбрано некорректное значение!");
		ВыбранноеЗначение				= Неопределено;
		СтруктураДанныхКонтактногоЛица	= Неопределено;
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение				= ДанныеКонтактногоЛица.КонтактноеЛицо;
	СтруктураДанныхКонтактногоЛица	= ДанныеКонтактногоЛица;	
	
КонецПроцедуры

Процедура ПодписантОкончаниеВводаТекста(ЭтаФорма, Объект, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) Экспорт
	
	Если Текст = "" Тогда // Ручная очистка поля
		СтандартнаяОбработка = Истина;
		Возврат;		
	КонецЕсли;
	
	ПодписантАвтоПодбор(ЭтаФорма, Объект, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Неопределено, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПодписантАвтоПодбор(ЭтаФорма, Объект, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) Экспорт
	
	Если Ожидание = 0 Тогда // Быстрый выбор
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = РаботаСОтчетами.ПолучитьДанныеВыбораКонтактныхЛиц(Объект, Текст);	
	
КонецПроцедуры

Процедура ПодписантОтчетаПриИзменении(ЭтаФорма) Экспорт
	
	ДополнительныеСвойства = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;		
	
	Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица") Тогда
		ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица");	
	КонецЕсли;	
	
	ПодписантПриИзменении(ЭтаФорма.Подписант, ДополнительныеСвойства.СтруктураДанныхКонтактногоЛица);

КонецПроцедуры

Процедура ПодписантПриИзменении(Подписант, СтруктураДанныхКонтактногоЛица) Экспорт
	
	Если Не ЗначениеЗаполнено(Подписант) Тогда
		СтруктураДанныхКонтактногоЛица = Неопределено;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
